Pandas
------

- The Pandas is a Python library 

- It is top on NumPy

- What are the uses of Pandas

    - data cleaning
    
    - to handle large data sets
    
    - to handle data preprocessing
    
    - to handle data analysis
    
    - to handle data manipulation
    
    - data visualisation
 
    - data transform
 
- Pandas is the process with the tabular format

- Pandas is the process with the CSV and Excel and SQL format and others

- It works well with other libraries, those are scikit-learn, OpenCV, Matplotlib and Seaborn.

- Pandas support mainly two datasets process those are :

    - Series : 1D Array
    
    - DataFrame : 2D Array or Tabular
 
- Difference between numpy and pandas :-

- NUMPY -

    - structure : It contains homogeneous with non labels
    
    - data types : homogeneous (int, float, complex, str, boolean)
    
    - data labels : it contains no labels of row and column
    
    - work : Numpy work speed and support for Statistics

- PANDAS -

    - structure : It contains tabular format data with heterogeneous 
    
    - data types : heterogeneous (mix of any object +int + float + boolean)
    
    - data labels : it contains labels of row and column
    
    - work : Pandas work speed and support for mathematics and tabular format

Series
----

- the series contains 1D array

- by default series have labels from 0 to n.

- how to access series --> pd.Series()

In [6]:
import pandas as pd

In [8]:
pd.Series([1,2,3,4,5,6])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [10]:
pd.Series([3,'Hi',4.5,4+5j])

0         3
1        Hi
2       4.5
3    (4+5j)
dtype: object

In [14]:
data = pd.Series([3,'Hi',4.5,4+5j])
data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [16]:
data = pd.Series([3,'Hi',4.5,4+5j], name='sample')
data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: sample
Non-Null Count  Dtype
--------------  -----
4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [18]:
pd.Series({1,2,3,4,5,6})

TypeError: 'set' type is unordered

In [20]:
pd.Series((1,2,3,4,5,6))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [22]:
import numpy as np

arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
pd.Series(['Ram','Shyam','Laxman'])

0       Ram
1     Shyam
2    Laxman
dtype: object

In [26]:
pd.Series(['Ram','Shyam','Laxman'],index=['A','B','C'])

A       Ram
B     Shyam
C    Laxman
dtype: object

In [28]:
pd.Series(['Ram','Shyam','Laxman'],index=['A','B'])

ValueError: Length of values (3) does not match length of index (2)

In [ ]:
# pd.Series(data=None,
#         index=None,
#         dtype: 'Dtype | None' = None,
#         name=None)

In [30]:
pd.Series([1,2,3,4,5],dtype='str')

0    1
1    2
2    3
3    4
4    5
dtype: object

In [32]:
pd.Series([1,2,3,4,5],dtype='float')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [34]:
pd.Series([1,2,3,4,5],dtype='bool')

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [36]:
pd.Series([1,2,3,4,5],dtype='float32')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float32

DataFrame
----

- It is 2D array / tabular format

- It contains rows --> records or tuples or values and columns --> fields or attributes or labels

- it contains index and column

In [39]:
pd.DataFrame([1,2,3,4])

   0
0  1
1  2
2  3
3  4

In [43]:
pd.DataFrame([1,2,3,4],columns=['A'])

   A
0  1
1  2
2  3
3  4

In [45]:
pd.DataFrame([1,2,3,4],index=['a','b','c','d'] ,columns=['A'])

   A
a  1
b  2
c  3
d  4

In [53]:
pd.DataFrame([[1,2,3,4],[5,6,7,8]],columns=['A','B','C','D'],index=[101,102])

     A  B  C  D
101  1  2  3  4
102  5  6  7  8

In [61]:
pd.DataFrame({'Name':['Ram','Shyam','Laxman'],
              'Age':[22,24,26]})

     Name  Age
0     Ram   22
1   Shyam   24
2  Laxman   26

In [ ]:
# dictionary --> key value pair
# keys : columns / labels
# values : rows / records

In [63]:
pd.DataFrame({'Name':{'Ram','Shyam','Laxman'},
              'Age':[22,24,26]})

TypeError: 'set' type is unordered

In [69]:
pd.DataFrame({ 'Name':np.array(['Ram','Shyam','Laxman']),
              'Age':np.array([22,24,26])
             })

     Name  Age
0     Ram   22
1   Shyam   24
2  Laxman   26

In [71]:
pd.DataFrame({ 'Name':np.array(['Ram','Shyam','Laxman']),
              'Age':range(3)
             })

     Name  Age
0     Ram    0
1   Shyam    1
2  Laxman    2

In [75]:
pd.DataFrame({ 'Name':np.array(['Ram','Shyam','Laxman']),
              'Age':np.arange(22,27,2)
             })

     Name  Age
0     Ram   22
1   Shyam   24
2  Laxman   26

In [77]:
data = pd.DataFrame({ 'Name':np.array(['Ram','Shyam','Laxman']),
              'Age':np.arange(22,27,2)
             })

data.head(2)

    Name  Age
0    Ram   22
1  Shyam   24

In [79]:
data.head()

     Name  Age
0     Ram   22
1   Shyam   24
2  Laxman   26

In [81]:
import pandas as pd


data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Heidi', 'Ivan', 'Jack',
             'Karen', 'Liam', 'Mia', 'Nina', 'Oscar', 'Paul', 'Queen', 'Ryan', 'Sara', 'Tom'],
    'Salary': [70000, 65000, 72000, 60000, 75000, 68000, 71000, 63000, 74000, 67000,
               70000, 65000, 72000, 60000, 75000, 68000, 71000, 63000, 74000, 67000],
    'Department': ['HR', 'Engineering', 'Sales', 'HR', 'Engineering', 'Sales', 'HR', 'Engineering', 'Sales', 'HR',
                   'Engineering', 'Sales', 'HR', 'Engineering', 'Sales', 'HR', 'Engineering', 'Sales', 'HR', 'Engineering']
}

df = pd.DataFrame(data)

print(df)

    ID     Name  Salary   Department
0    1    Alice   70000           HR
1    2      Bob   65000  Engineering
2    3  Charlie   72000        Sales
3    4    David   60000           HR
4    5      Eve   75000  Engineering
5    6    Frank   68000        Sales
6    7    Grace   71000           HR
7    8    Heidi   63000  Engineering
8    9     Ivan   74000        Sales
9   10     Jack   67000           HR
10  11    Karen   70000  Engineering
11  12     Liam   65000        Sales
12  13      Mia   72000           HR
13  14     Nina   60000  Engineering
14  15    Oscar   75000        Sales
15  16     Paul   68000           HR
16  17    Queen   71000  Engineering
17  18     Ryan   63000        Sales
18  19     Sara   74000           HR
19  20      Tom   67000  Engineering

In [83]:
df.head()

   ID     Name  Salary   Department
0   1    Alice   70000           HR
1   2      Bob   65000  Engineering
2   3  Charlie   72000        Sales
3   4    David   60000           HR
4   5      Eve   75000  Engineering

In [85]:
df.tail()

    ID   Name  Salary   Department
15  16   Paul   68000           HR
16  17  Queen   71000  Engineering
17  18   Ryan   63000        Sales
18  19   Sara   74000           HR
19  20    Tom   67000  Engineering

In [87]:
df.head(10)

   ID     Name  Salary   Department
0   1    Alice   70000           HR
1   2      Bob   65000  Engineering
2   3  Charlie   72000        Sales
3   4    David   60000           HR
4   5      Eve   75000  Engineering
5   6    Frank   68000        Sales
6   7    Grace   71000           HR
7   8    Heidi   63000  Engineering
8   9     Ivan   74000        Sales
9  10     Jack   67000           HR

In [89]:
df.head(-5)

    ID     Name  Salary   Department
0    1    Alice   70000           HR
1    2      Bob   65000  Engineering
2    3  Charlie   72000        Sales
3    4    David   60000           HR
4    5      Eve   75000  Engineering
5    6    Frank   68000        Sales
6    7    Grace   71000           HR
7    8    Heidi   63000  Engineering
8    9     Ivan   74000        Sales
9   10     Jack   67000           HR
10  11    Karen   70000  Engineering
11  12     Liam   65000        Sales
12  13      Mia   72000           HR
13  14     Nina   60000  Engineering
14  15    Oscar   75000        Sales

In [91]:
df['ID']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
Name: ID, dtype: int64

In [93]:
df['Name']

0       Alice
1         Bob
2     Charlie
3       David
4         Eve
5       Frank
6       Grace
7       Heidi
8        Ivan
9        Jack
10      Karen
11       Liam
12        Mia
13       Nina
14      Oscar
15       Paul
16      Queen
17       Ryan
18       Sara
19        Tom
Name: Name, dtype: object

In [95]:
df['Salary']

0     70000
1     65000
2     72000
3     60000
4     75000
5     68000
6     71000
7     63000
8     74000
9     67000
10    70000
11    65000
12    72000
13    60000
14    75000
15    68000
16    71000
17    63000
18    74000
19    67000
Name: Salary, dtype: int64

In [97]:
df['Department']

0              HR
1     Engineering
2           Sales
3              HR
4     Engineering
5           Sales
6              HR
7     Engineering
8           Sales
9              HR
10    Engineering
11          Sales
12             HR
13    Engineering
14          Sales
15             HR
16    Engineering
17          Sales
18             HR
19    Engineering
Name: Department, dtype: object

In [99]:
df['Salary'].head(5)

0    70000
1    65000
2    72000
3    60000
4    75000
Name: Salary, dtype: int64

In [101]:
df['Name'].head(5)

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [103]:
df[['ID','Name']]

    ID     Name
0    1    Alice
1    2      Bob
2    3  Charlie
3    4    David
4    5      Eve
5    6    Frank
6    7    Grace
7    8    Heidi
8    9     Ivan
9   10     Jack
10  11    Karen
11  12     Liam
12  13      Mia
13  14     Nina
14  15    Oscar
15  16     Paul
16  17    Queen
17  18     Ryan
18  19     Sara
19  20      Tom

In [105]:
df[['Salary','Name']]

    Salary     Name
0    70000    Alice
1    65000      Bob
2    72000  Charlie
3    60000    David
4    75000      Eve
5    68000    Frank
6    71000    Grace
7    63000    Heidi
8    74000     Ivan
9    67000     Jack
10   70000    Karen
11   65000     Liam
12   72000      Mia
13   60000     Nina
14   75000    Oscar
15   68000     Paul
16   71000    Queen
17   63000     Ryan
18   74000     Sara
19   67000      Tom

In [107]:
df[['ID','Name','Salary']]

    ID     Name  Salary
0    1    Alice   70000
1    2      Bob   65000
2    3  Charlie   72000
3    4    David   60000
4    5      Eve   75000
5    6    Frank   68000
6    7    Grace   71000
7    8    Heidi   63000
8    9     Ivan   74000
9   10     Jack   67000
10  11    Karen   70000
11  12     Liam   65000
12  13      Mia   72000
13  14     Nina   60000
14  15    Oscar   75000
15  16     Paul   68000
16  17    Queen   71000
17  18     Ryan   63000
18  19     Sara   74000
19  20      Tom   67000

In [109]:
df[['Name','Department']]

       Name   Department
0     Alice           HR
1       Bob  Engineering
2   Charlie        Sales
3     David           HR
4       Eve  Engineering
5     Frank        Sales
6     Grace           HR
7     Heidi  Engineering
8      Ivan        Sales
9      Jack           HR
10    Karen  Engineering
11     Liam        Sales
12      Mia           HR
13     Nina  Engineering
14    Oscar        Sales
15     Paul           HR
16    Queen  Engineering
17     Ryan        Sales
18     Sara           HR
19      Tom  Engineering

In [111]:
df.columns

Index(['ID', 'Name', 'Salary', 'Department'], dtype='object')

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        20 non-null     object
 2   Salary      20 non-null     int64
 3   Department  20 non-null     object
dtypes: int64(2), object(2)
memory usage: 772.0+ bytes

In [115]:
df.tail(-10)

    ID   Name  Salary   Department
10  11  Karen   70000  Engineering
11  12   Liam   65000        Sales
12  13    Mia   72000           HR
13  14   Nina   60000  Engineering
14  15  Oscar   75000        Sales
15  16   Paul   68000           HR
16  17  Queen   71000  Engineering
17  18   Ryan   63000        Sales
18  19   Sara   74000           HR
19  20    Tom   67000  Engineering

In [120]:
df

    ID     Name  Salary   Department
0    1    Alice   70000           HR
1    2      Bob   65000  Engineering
2    3  Charlie   72000        Sales
3    4    David   60000           HR
4    5      Eve   75000  Engineering
5    6    Frank   68000        Sales
6    7    Grace   71000           HR
7    8    Heidi   63000  Engineering
8    9     Ivan   74000        Sales
9   10     Jack   67000           HR
10  11    Karen   70000  Engineering
11  12     Liam   65000        Sales
12  13      Mia   72000           HR
13  14     Nina   60000  Engineering
14  15    Oscar   75000        Sales
15  16     Paul   68000           HR
16  17    Queen   71000  Engineering
17  18     Ryan   63000        Sales
18  19     Sara   74000           HR
19  20      Tom   67000  Engineering

In [122]:
df.value_counts()

ID  Name     Salary  Department
1   Alice    70000   HR             1
2   Bob      65000   Engineering    1
19  Sara     74000   HR             1
18  Ryan     63000   Sales          1
17  Queen    71000   Engineering    1
16  Paul     68000   HR             1
15  Oscar    75000   Sales          1
14  Nina     60000   Engineering    1
13  Mia      72000   HR             1
12  Liam     65000   Sales          1
11  Karen    70000   Engineering    1
10  Jack     67000   HR             1
9   Ivan     74000   Sales          1
8   Heidi    63000   Engineering    1
7   Grace    71000   HR             1
6   Frank    68000   Sales          1
5   Eve      75000   Engineering    1
4   David    60000   HR             1
3   Charlie  72000   Sales          1
20  Tom      67000   Engineering    1
Name: count, dtype: int64

In [124]:
df.values

array([[1, 'Alice', 70000, 'HR'],
       [2, 'Bob', 65000, 'Engineering'],
       [3, 'Charlie', 72000, 'Sales'],
       [4, 'David', 60000, 'HR'],
       [5, 'Eve', 75000, 'Engineering'],
       [6, 'Frank', 68000, 'Sales'],
       [7, 'Grace', 71000, 'HR'],
       [8, 'Heidi', 63000, 'Engineering'],
       [9, 'Ivan', 74000, 'Sales'],
       [10, 'Jack', 67000, 'HR'],
       [11, 'Karen', 70000, 'Engineering'],
       [12, 'Liam', 65000, 'Sales'],
       [13, 'Mia', 72000, 'HR'],
       [14, 'Nina', 60000, 'Engineering'],
       [15, 'Oscar', 75000, 'Sales'],
       [16, 'Paul', 68000, 'HR'],
       [17, 'Queen', 71000, 'Engineering'],
       [18, 'Ryan', 63000, 'Sales'],
       [19, 'Sara', 74000, 'HR'],
       [20, 'Tom', 67000, 'Engineering']], dtype=object)

In [128]:
df.iloc[10:15]

    ID   Name  Salary   Department
10  11  Karen   70000  Engineering
11  12   Liam   65000        Sales
12  13    Mia   72000           HR
13  14   Nina   60000  Engineering
14  15  Oscar   75000        Sales

In [136]:
df.iloc[10:15,:]

    ID   Name  Salary   Department
10  11  Karen   70000  Engineering
11  12   Liam   65000        Sales
12  13    Mia   72000           HR
13  14   Nina   60000  Engineering
14  15  Oscar   75000        Sales

In [138]:
df.iloc[2:15:5,:]

    ID     Name  Salary   Department
2    3  Charlie   72000        Sales
7    8    Heidi   63000  Engineering
12  13      Mia   72000           HR

In [142]:
df.iloc[2:15:5,0:4:1]

    ID     Name  Salary   Department
2    3  Charlie   72000        Sales
7    8    Heidi   63000  Engineering
12  13      Mia   72000           HR

In [144]:
df.iloc[2:15:5,0:4:2]

    ID  Salary
2    3   72000
7    8   63000
12  13   72000

In [148]:
df.iloc[2:15:5,0:4:1]['Name']

2     Charlie
7       Heidi
12        Mia
Name: Name, dtype: object

In [150]:
df.iloc[2:15:5,0:4:1]['Department']

2           Sales
7     Engineering
12             HR
Name: Department, dtype: object

In [154]:
df.loc[5:10,'Name':'Salary']

     Name  Salary
5   Frank   68000
6   Grace   71000
7   Heidi   63000
8    Ivan   74000
9    Jack   67000
10  Karen   70000

In [156]:
df.loc[5:10,:]

    ID   Name  Salary   Department
5    6  Frank   68000        Sales
6    7  Grace   71000           HR
7    8  Heidi   63000  Engineering
8    9   Ivan   74000        Sales
9   10   Jack   67000           HR
10  11  Karen   70000  Engineering

In [158]:
df.loc[5:10,'ID':'Department']

    ID   Name  Salary   Department
5    6  Frank   68000        Sales
6    7  Grace   71000           HR
7    8  Heidi   63000  Engineering
8    9   Ivan   74000        Sales
9   10   Jack   67000           HR
10  11  Karen   70000  Engineering